const names = ['Саша', 'Елена', 'Игорь', 'Уля']
const letters = ['e', 'c', 'd', 'b', 'a']

// names.push('Алена') // Добавляет элемент в конец массива
// names.unshift('Алена') // Добавляет элемент в начало массива (лучше не использовать. Работает медленнее чем push)
// names.shift() // Убирает, и возвращает первый элемент из массива и возвращает
// names.pop() // Убирает, и возвращает последний элемент из массива
// names.reverse() // Изменяет массив, располагает элементы в обратно порядке (лучше не использовать)
// names.toReversed() // Возвращает новый массив с расположенными в обратном порядке элементами
// letters.sort() // Изменяет массив, сортируя его (лучше не использовать)
// letters.toSorted() // Возвращает новый массив, сортируя его
// names.splice(2, 1) // Изменяет содержимое массива, удаляя элементы
// names.toSpliced(2, 1) // Возвращает новый массив, удаляя элементы
// const index = names.indexOf('Елена') // Находит и возвращает индекс элемента в массиве по названию
// names.with(2, 'Марина') // Возвращает новый массив. Изменяет элемент в массиве
